# Cleaning Data

In [1]:
import pandas as pd

In [11]:
titanic = pd.read_csv("titanic_imp.csv")

In [3]:
titanic[["Survived", "Gender", "Age", "Fare", "Emb", "Deck"]].describe()

       Survived Gender           Age   Fare  Emb Deck
count       894    894           758    894  892  203
unique        4      2            92    248    3    7
top           0   male  Missing Data  $8.05    S    C
freq        551    580            41     43  647   59

In [4]:
titanic.head()

  Survived  Class  Gender   Age  SipSp  ParCh      Fare Emb Deck
0        0      3    male  22.0      1      0     $7.25   S  NaN
1        1      1  female  38.0      1      0  $71.2833   C    C
2        1      3  female  26.0      0      0    $7.925   S  NaN
3        1      1  female  35.0      1      0     $53.1   S    C
4        0      3    male  35.0      0      0     $8.05   S  NaN

In [12]:
titanic.Survived.unique()

array(['0', '1', 'yes', 'no'], dtype=object)

In [13]:
titanic.Survived.value_counts()

0      551
1      341
yes      1
no       1
Name: Survived, dtype: int64

In [14]:
titanic.Survived.replace(to_replace= ["yes", "no"], value = ['1', '0'], inplace = True)

In [15]:
titanic.Survived.value_counts()

0    552
1    342
Name: Survived, dtype: int64

In [16]:
titanic.Survived.unique()

array(['0', '1'], dtype=object)